{"posts":[{"id":1,"title":"How to deal with social anxiety as a journalist","text":"I’m an undergrad journalism student currently and have my first big assignment where I need to interview a student for an article that may or may not be published in the student newspaper. How do I approach students on campus that I don’t know without making it awkward? My professor said that I could take the easy route and interview one of my acquaintances (I’m writing about rising costs of living and how they are affecting students), but I’d rather learn to deal with my anxiety sooner than later.\n\nThe problem is that if students aren’t in groups, a lot of the time they have their headphones in, so I’m always afraid I’ll be bothering them.","comments":[],"reactions":{"laugh":0,"shock":1,"angry":0},"gif":"https://media1.giphy.com/media/FcTdv3xQKhCIE/giphy.gif?cid=76c9e445iy2okavr13fhfgoef30951vrrug4qhqx03l7989d&rid=giphy.gif&ct=g","dateTime":"16:32 27/10/2022"},{"id":2,"title":"Is there a market for freelance newsletter production/editing?","text":"There's been this huge exodus of reporters over the last few years from national outlets to Substack and its clones. But most standalone newsletters aren't moneymakers -- and my hunch is that's at least partly because most newsletters kind of suck to read.\n\nI'm a fairly experienced editor, and my most recent gig was at a digital-first national outlet where buzzy, scoop-filled newsletters were a huge driver of traffic and revenue. I've been thinking more and more about starting a side hustle editing Substacks, but I'm worried that nobody will see any value proposition there, even though I can point to concrete benefits (higher open rates etc).\n\nThoughts? Am I just embarrassing myself here? (And pardon the burner account.)","comments":[],"reactions":{"laugh":0,"shock":0,"angry":1},"gif":"https://media4.giphy.com/media/xT0xeuOy2Fcl9vDGiA/giphy.gif?cid=76c9e445qqn4wrlem5ynl2ew4lfx351b948yd5hpc6mupvyk&rid=giphy.gif&ct=g","dateTime":"16:34 27/10/2022"},{"id":3,"title":"Looking to start my career in Seattle!","text":"Hi, I used to write freelance back in my home country but haven’t done anything in a couple years due to grad school and moving to the US. I’m now working as a software engineer but I’d love to get back to writing freelance/part-time, perhaps starting with book reviews at the moment. Who do I reach out to in Seattle? I emailed a book editor at the Seattle times but got no reply. Any other resources I could look into? Would really appreciate any advice!","comments":[],"reactions":{"laugh":1,"shock":0,"angry":0},"gif":"https://media1.giphy.com/media/phJ6eMRFYI6CQ/giphy.gif?cid=76c9e445hz3fzgodupt624gbdn43pvioyh9k0okh4y1lgmer&rid=giphy.gif&ct=g","dateTime":"16:36 27/10/2022"}]}